TestEDTEdu/src/Documents/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажи</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TestEDTEdu/src/Documents/Продажи/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ИдентификаторСтроки = Элементы.Товары.ТекущаяСтрока;
	ПересчитатьСуммуДокумента(ИдентификаторСтроки)
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ИдентификаторСтроки = Элементы.Товары.ТекущаяСтрока;
	ПересчитатьСуммуДокумента(ИдентификаторСтроки)
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьСуммуДокумента(ИдентификаторСтроки)
	СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена*СтрокаТЧ.Количество;
КонецПроцедуры


#КонецОбласти
